[
  {
    "Version": "2.1.0",
    "ReleaseDate": "January 27, 2025",
    "IsLatest": true,
    "NewFeatures": [
      "Blacklisting functionality has returned",
      "Bot Equipment logging functionality has returned",
      "Custom Item Import Functionality has returned",
      "Mod Compatibility Configuration has returned",
      "Allow bots to prestige past 4 if using Content Backport - Prestiges",
      "Webconfig toggle to allow Pmcs to spawn with WTT Backport Dogtags",
      "Webconfig toggle to set chance of TUE/EOD bots having version specific dogtags"
    ],
    "Changes": [
      "Removed leftover console logging when changing presets",
      "Added (Poverty) label to Bot Equipment Logging Tier if PMC rolled to be in poverty",
      "Added V40 Mini-Grenade to Grenade List for Grenade counter in Bot Equipment Logging",
      "Added `unhandled` bot equipment logging (for bots not handled by APBS)",
      "Added Release Note formatter so I dont have to keep reformatting everything for Github releases. Lol.",
      "Adjusted logic when creating a new preset - it will autoselect your newly made preset",
      "Adjusted APBS database handling for sanitization purposes.",
      "Adjusted webconfig mod save/reload to also rerun mod import if enabled, then run blacklisting if enabled"
    ],
    "BugFixes": [
      "Resolved PrestigeLevel being wiped out by SPT during bot gen",
      "Resolved Zryachiy not being handled by APBS",
      "Resolved bot logging not logging the correct tier if the bot was marked for poverty",
      "Resolved Scav Loot Blacklist not working",
      "Resolved Boss Loot Blacklist not working",
      "Resolved Follower Loot Blacklist not working",
      "Resolved Special Loot Blacklist not working",
      "Resolved Logging not properly putting log levels in correct files. Woops.",
      "Resolved Mountable Headphones going into Headphone slots on bots",
      "Resolved Non-mountable Headphones going into a helmets mod slot on bots",
      "Resolved normalize health not skipping usec/bear properly",
      "Resolved normalize health applying head value to chest",
      "Resolved webconfig Pmc Ammo Tier Sliding Undo button not undoing properly"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.11",
    "ReleaseDate": "December 24, 2025",
    "IsLatest": false,
    "NewFeatures": [],
    "Changes": [],
    "BugFixes": [
      "Updated FilterSightsByWeaponType code for 4.0.9 changes",
      "Updated Armour Durability code for 4.0.9 changes",
      "Updated Nuget packages to 4.0.9"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.10",
    "ReleaseDate": "December 22, 2025",
    "IsLatest": false,
    "NewFeatures": [
      "Bot Armour Durability is now configurable"
    ],
    "Changes": [],
    "BugFixes": [
      "Resolved Blicky Mode breaking bot generation for PMCs"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.9",
    "ReleaseDate": "December 9, 2025",
    "IsLatest": false,
    "NewFeatures": [],
    "Changes": [
      "Adjusted some methods getting the PMC Profile, should help people who use Item Info and have massively inflated profile sizes due to how that mod works"
    ],
    "BugFixes": [],
    "KnownIssues": []
  },
  {
    "Version": "2.0.8",
    "ReleaseDate": "November 28, 2025",
    "IsLatest": false,
    "NewFeatures": [],
    "Changes": [
      "Prevented user from changing to a preset, then immediately navigating to edit the preset. Save must happen first"
    ],
    "BugFixes": [
      "Resolved Presets saving incorrectly in specific scenarios",
      "Resolved Presets weight changes not applying if adding an item from available -> used -> edit weight",
      "Resolved Scav Equal Equipment Tiering not working"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.7",
    "ReleaseDate": "November 27, 2025",
    "IsLatest": false,
    "NewFeatures": [
      "Preset Editor is now live in the Web Config",
      "Presets are now easy-ish to make. If you want to share them, create an add-on for APBS on the Forge",
      "Create Preset option added to Web Config"
    ],
    "Changes": [
      "ExamplePreset no longer ships with the mod zip (due to new create preset option, it'll create and copy the necessary starting files)",
      "Lots and lots of minor code fixes that shouldn't amount to anything but cleanliness",
      "Added Preset saving to web config",
      "Added Preset change tracking",
      "Added Vanilla Item Caching on first mod load",
      "Added M60E6 to known weapons without small magazine (will stop throwing the MAGAZINE warning)"
    ],
    "BugFixes": [
      "Resolved Force Stock not working",
      "Resolved Force Dust Cover not working",
      "Resolved Force Optical Devices not working",
      "Resolved Force Muzzle Children not working - lol",
      "Resolved Override Muzzle Chances not working",
      "Resolved Allow T-7 Thermal Goggles not working",
      "Resolved Override Plate Chances not working",
      "Resolved missing Caliber725",
      "Resolved missing RShG-2 72.5mm rocket launcher",
      "Resolved missing FORT Redut-M body armor (SK Woodland)",
      "Resolved missing BNTI Kirasa-N body armor (Green)",
      "Resolved missing Hexatac HPC Plate Carrier (MultiCam)",
      "Resolved missing HighCom Trooper TFO body armor (Coyote)",
      "Resolved missing Crye Precision AVS plate carrier (MultiCam)",
      "Resolved missing 5.11 Tactical TacTec plate carrier (Storm)",
      "Resolved missing Camelbak Tri-Zip assault backpack (MultiCam)",
      "Resolved missing 5.11 Tactical RUSH 100 backpack (Black)",
      "Resolved missing LBT-1476A 3Day Pack (MultiCam Alpine)",
      "Resolved missing Mystery Ranch Terraframe backpack (Olive Drab)",
      "Resolved missing Mystery Ranch Terraframe backpack (Christmas Edition)",
      "Resolved missing Akula push dagger",
      "Resolved missing ANA Tactical Alpha chest rig (MultiCam)",
      "Resolved missing BlackRock chest rig (Khaki)",
      "Resolved missing Blicky in Mods Json Tier1-7"
    ],
    "KnownIssues": [
      "Scav Equal Equipment Tiering causes the config to fail to save"
    ]
  },
  {
    "Version": "2.0.6",
    "ReleaseDate": "November 17, 2025",
    "IsLatest": false,
    "NewFeatures": [],
    "Changes": [
      "Removed incorrect logging on Resource Randomization & Weapon Durability configs"
    ],
    "BugFixes": [],
    "KnownIssues": [
      "Plate Chances via config have been reported to not work. Will be investigated and resolved in future update (eventually)."
    ]
  },
  {
    "Version": "2.0.5",
    "ReleaseDate": "November 15, 2025",
    "IsLatest": false,
    "NewFeatures": [
      "Option to lock web config behind an authorization code."
    ],
    "Changes": [],
    "BugFixes": [],
    "KnownIssues": [
      "Plate Chances via config have been reported to not work. Will be investigated and resolved in future update."
    ]
  },
  {
    "Version": "2.0.4",
    "ReleaseDate": "November 11, 2025",
    "IsLatest": false,
    "NewFeatures": [
      "Presets have returned."
    ],
    "Changes": [],
    "BugFixes": [],
    "KnownIssues": [
      "Plate Chances via config have been reported to not work. Will be investigated and resolved in future update."
    ]
  },
  {
    "Version": "2.0.3",
    "ReleaseDate": "November 4, 2025",
    "IsLatest": false,
    "NewFeatures": [],
    "Changes": [],
    "BugFixes": [
      "Resolved Pmc dog tags not being the correct one",
      "Resolved Pmc sometimes not being able to Prestige when they should be able to",
      "Resolved Stack Overflow from recursive method `ContainsRequiredMod`"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.2",
    "ReleaseDate": "November 1, 2025",
    "IsLatest": false,
    "NewFeatures": [],
    "Changes": [],
    "BugFixes": [
      "Resolved T-7 Thermal Adapter not being removed correctly",
      "Resolved Pmc Quests for Location not selecting correctly all the time"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.1",
    "ReleaseDate": "October 31, 2025",
    "IsLatest": false,
    "NewFeatures": [
      "Added Checkbox to allow the Web Configuration page to check for updates to APBS",
      "Added Release Notes to Web Configuration"
    ],
    "Changes": [
      "Skipped extra magazine generation for the SV98 if Pmc is assigned `Fishing Gear` quest"
    ],
    "BugFixes": [
      "Resolved Fika Headless not being able to generate a profile if you install mods first (That's on you for not following the Fika Wiki)",
      "Resolved Fika Headless bot generation issues if you install APBS before creating a user profile and completing a raid",
      "Resolved Pmc Item Limits not being set",
      "Resolved Pmc Weapon Mod Limits not being set",
      "Resolved Large Magazine Limit not working properly",
      "Resolved Boss, Follower, and Special loot not generating at all despite being enabled"
    ],
    "KnownIssues": []
  },
  {
    "Version": "2.0.0",
    "ReleaseDate": "October 27, 2025",
    "IsLatest": false,
    "NewFeatures": [
      "Configuration Application has been replaced with this fancy web configuration instead"
    ],
    "Changes": [
      "Configuration can be edited while the server is running, data can be reloaded or saved while nobody is in raid",
      "Temporarily removed Presets",
      "Temporarily removed Mod Importing"
    ],
    "BugFixes": [],
    "KnownIssues": [
      "Bosses Have Lega Medals may not work with APBS"
    ]
  }
]